task_6_blog/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test_title"], ["body", "Test_body1231"], ["created_at", "2022-06-15 09:10:17.648072"], ["updated_at", "2022-06-15 09:10:17.648072"]]

  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2, "status" = $3 WHERE "articles"."id" = $4  [["body", "Test_body1234"], ["updated_at", "2022-06-15 10:39:22.613953"], ["status", "archived"], ["id", 1]]