task_6_blog/app/controllers/comments_controller.rb

  def create
    #создание коментария
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "test_comment"], ["body", "test_comment__"], ["article_id", 1], ["created_at", "2022-06-15 09:25:35.589321"], ["updated_at", "2022-06-15 09:25:35.589321"]]